app/controllers/home_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = Product.search(params[:search])

SELECT "users".* FROM "users"
---
  def users
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
---
  def artist_profile
    @artist = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
---
  def upvote_product
    if params[:type] == 'artist'
      @artist = User.find(params[:id])
      @artist.liked_by current_user
    else
        @product = Product.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
---
  def downvote_product
    if params[:type] == 'artist'
      @artist = User.find(params[:id])
      @artist.downvote_from current_user
    else
      @product = Product.find(params[:id])