app/controllers/registrations_controller.rb

   def create
    @user = User.new(params[:user])
    @user.password = Devise.friendly_token[0,20]
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("address", "authentication_token", "avatar", "bio", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "gender", "interview", "last_sign_in_at", "last_sign_in_ip", "name", "provider", "remember_created_at", "reset_password_sent_at", "reset_password_token", "role", "sign_in_count", "uid", "updated_at", "workshop_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)