app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "bio" = 'El alebrije es una artesanía de reciente reconocimiento inventada por: Pedro Linares López en 1936, hecha de diferentes tipos de papel y pintada con colores alegres y vibrantes. Generalmente, representan a un animal imaginario, conformado por elementos fisonómicos de animales diferentes. Los alebrijes son una combinación entre varios animales, no solo fantásticos si no también reales.', "updated_at" = '2013-06-25 21:54:55.136706' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])